In [ ]:
'''Problem 1: Conditional Selection
Find all rows where:
Marks are greater than 80,
City is either "New York" or "Chicago".
Problem 2: Adding New Columns
Create a new column called "Category" where:
Marks > 85 → "A"
Marks > 70 and ≤ 85 → "B"
Marks ≤ 70 → "C".
Problem 3: Working with Indexing
Set the "Name" column as the index.
After performing the operation, reset the index back to default.
Problem 4: Aggregation
Find the total Marks for each city using groupby.
Find the maximum Age for each gender.
Bonus Problem: Combining Conditions
Find all rows where:
Marks are greater than 85,
Age is less than 22,
And City is not "New York". '''

In [1]:
import pandas as pd

In [2]:
d1={"Name":["John","Alice","Bob","Emma"],
"Age":[20,22,12,21],
"Gender":["Male","Female","Male","Female"],
"Marks":[88,92,75,89],
"City":["New York","Los Angeles","Chicago","San Fransico"]}
vr=pd.DataFrame(d1)

In [4]:
vr.loc[(vr["Marks"]>80)&((vr["City"]=="New York")|(vr["City"]=="Chicago"))]

   Name  Age Gender  Marks      City
0  John   20   Male     88  New York

In [6]:
def cat(Marks):
    if Marks >85:
        return "A"
    elif Marks>70:
        return "B"
    else:
        return "C"
vr["Category"]=vr["Marks"].apply(cat)
vr

    Name  Age  Gender  Marks          City Category
0   John   20    Male     88      New York        A
1  Alice   22  Female     92   Los Angeles        A
2    Bob   12    Male     75       Chicago        B
3   Emma   21  Female     89  San Fransico        A

In [15]:
vr.set_index("Name")
vr.reset_index()

   index   Name  Age  Gender  Marks          City Category
0      0   John   20    Male     88      New York        A
1      1  Alice   22  Female     92   Los Angeles        A
2      2    Bob   12    Male     75       Chicago        B
3      3   Emma   21  Female     89  San Fransico        A

In [19]:
a1=vr.groupby('City')["Marks"].sum() # groupby mistake you done
a4=vr.groupby('Gender')["Age"].max()
a1

City
Chicago         75
Los Angeles     92
New York        88
San Fransico    89
Name: Marks, dtype: int64

In [20]:
vr.loc[(vr["Marks"]>85)&(vr["Age"]<22)&(vr["City"]!="New York")]

   Name  Age  Gender  Marks          City Category
3  Emma   21  Female     89  San Fransico        A